Revit 2027 API
ElectricalSystem.LoadName Property
 The LoadName of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LoadName { get; set; }
Public Property LoadName As String
	Get
	Set
public:
property String^ LoadName {
	String^ get ();
	void set (String^ value);
}
member LoadName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 This property is used to retrieve the LoadName of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace